function method1_init_system(V0_percent, L_percent)
global A B t0 x_start x_end

x_start = [0 0 10];
x_end = [0 0 0];
t0 = 0;

V0 = 6.17 * V0_percent/100;
L = 39 * L_percent/100;         
r21 = -0.69;	r31 = 6.14;     q21 = 1.22;
q31 = -3.12;        s21 = -0.44;    s31 = -3.1;     W = V0/L;       a11 = -r31*W;
a12 = -q31*W^2;     a21 = -r21;     a22 = -q21*W;   b11 = -s31*W^2; b21 = -s21*W;
A = [a11	a12     0;	% углова€ скорость рыскань€ омега_у
     a21	a22     0;	% угол дрейфа бетта
     1      0       0]; % угол рыскань€ фи
B = [b11; b21; 0];      % коэффицинты перед управл€ющим воздействием
end

